Revit 2027 API
FailureMessage Methods
The FailureMessage type exposes the following members.
Methods
Name | Description
AddResolution |  Adds a resolution for the failure.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAdditionalElements |  Retrieves list of the additional reference elements for the failure.
GetDefaultResolutionCaption |  Retrieves the caption of the default resolution of the failure.
GetDescriptionText |  Retrieves the description text of the failure.
GetFailingElements |  Retrieves list of the elements that have caused the failure.
GetFailureDefinitionId |  Retrieves the id of the failure definition for the failure.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSeverity |  Retrieves the severity of the failure.
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasResolutionOfType |  Checks if failure has a resolution of a given type.
HasResolutions |  Checks if the failure has any resolutions.
SetAdditionalElement |  Sets the additional reference element for the failure.
SetAdditionalElements |  Sets the additional reference elements for the failure.
SetFailingElement |  Sets the element that has caused the failure.
SetFailingElements |  Sets elements that have caused the failure.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace